// 物料管理库存状态第一层
const wipChart5 = {
  'mane': ['MFGI', 'MFGII', 'MFGIII', 'MFGV', 'MFGVI', 'MFGVII', 'MFGVIII'],
  '庫存前五大料號金額(K台幣)': [332, 254, 269, 78, 270, 310, 259, 164],
};
const wipChart6 = {
  'mane': ['MFGI', 'MFGII', 'MFGIII', 'MFGV', 'MFGVI', 'MFGVII', 'MFGVIII'],
  '庫存前五大料號金額(K台幣)': [332, 254, 269, 78, 270, 310, 259, 164],
};
const wipChart7 = {
  'month': ['一月', '二月', '三月', '四月', '五月', '六月', '七月', '八月', '九月', '十月', '十一月', '十二月'],
  '實際（K台幣）': [423, 535, 542, 488, 450, 480, 520, 452, 465, 598, 451, 458],
  'target': [500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500],
};
//  库存状态饼图第二层
const wipChart17 = {
  'mane': ['庫存良品', '維修使用中', '不良品待退'],
  '庫存物料各狀態數量(pcs)': [49, 58, 51],
};
const wipChart18 = {
  'mane': ['08-1033-03', '08-1035-03', '08-13951-02', '15-12345-02', '08-0910-02', '08-2864-01', '08-0875-02', '15-3434-01', '15-6123-02', '15-8019-01'],
  '維修庫存各料號金額（K台幣）': [33, 25, 26, 78, 27, 38, 25, 14, 18, 20],
};
const wipChart19 = {
  'mane': ['08-1033-03', '08-1035-03', '08-13951-02', '15-12345-02', '08-0910-02', '08-2864-01', '08-0875-02', '15-3434-01', '15-6123-02', '15-8019-01'],
  '維修庫存各料號數量（pcs）': [46, 20, 25, 68, 27, 31, 22, 16, 27, 28],
};

// 報廢管理
const wipChart14 = {
  'month': ['1月', '2月', '3月', '4月', '5月', '6月', '7月', '8月', '9月', '10月', '11月', '12月', '總計'],
  '報廢數量': [125, 255, 159, 167, 123, 231, 288, 332, 254, 269, 78, 86, 2367]
};
const wipChart15 = {
  'month': ['1月', '2月', '3月', '4月', '5月', '6月', '7月', '8月', '9月', '10月', '11月', '12月'],
  '報廢金額(美元)': [125, 255, 159, 167, 123, 231, 288, 332, 254, 269, 78, 86],
};
const wipChart16 = {
  'PN': ['PN1', 'PN2', 'PN3', 'PN4', 'PN5'],
  '良品數量（防潮柜）': [87, 56, 35, 24, 20],
  '待使用數量（維修員）': [76, 68, 34, 33, 29],
  '待退MRB數量（物料員）': [98, 78, 65, 45, 40],
};


export default {
  wipChart5,
  wipChart6,
  wipChart7,
  wipChart14,
  wipChart15,
  wipChart16,
  wipChart17,
  wipChart18,
  wipChart19
};