// 物料管理
const wipChart5 = {
  'mane': ['MFGI', 'MFGII', 'MFGIII', 'MFGV', 'MFGVI', 'MFGVII', 'MFGVIII'],
  '庫存前五大料號金額(K台幣)': [332, 254, 269, 78, 270, 310, 259, 164],
};
const wipChart6 = {
  'mane': ['MFGI', 'MFGII', 'MFGIII', 'MFGV', 'MFGVI', 'MFGVII', 'MFGVIII'],
  '庫存前五大料號金額(K台幣)': [332, 254, 269, 78, 270, 310, 259, 164],
};
const wipChart7 = {
  'month': ['一月', '二月', '三月', '四月', '五月', '六月', '七月', '八月', '九月', '十月', '十一月', '十二月'],
  '實際（K台幣）': [423, 535, 542, 488, 450, 480, 520, 452, 465, 598, 451, 458],
  'target': [500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500],
};
// 報廢管理
const wipChart14 = {
  'month': ['8月', '9月', '10月', '11月', '總計'],
  '報廢數量': [332, 254, 269, 78, 993]
};
const wipChart15 = {
  'month': ['8月份', '9月份', '10月份', '11月份'],
  '報廢金額(美元)': [332, 254, 269, 78],
};
const wipChart16 = {
  'PN': ['PN1', 'PN2', 'PN3', 'PN4', 'PN5'],
  '良品數量（防潮柜）': [87, 56, 35, 24, 20],
  '待使用數量（維修員）': [76, 68, 34, 33, 29],
  '待退MRB數量（物料員）': [98, 78, 65, 45, 40],
};

export default {
  wipChart5,
  wipChart6,
  wipChart7,
  wipChart14,
  wipChart15,
  wipChart16
};